zhongqi2/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (  0 -0.8 0 )
    ( 11 -0.8 0 )
    (  0  0.8 0 )
    ( 11  0.8 0 )
                 
    (  0 -0.8 1.5 )
    ( 11 -0.8 1.5 )
    (  0  0.8 1.5 )
    ( 11  0.8 1.5 )                    
);

blocks          
(
    hex (0 1 3 2 4 5 7 6) (220 32 30) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    patch inlet
    (
        (0 4 6 2)
    )
    wall bottom 
    (
        (0 1 3 2)
    )
    patch outlet
    (
        (1 5 7 3)
    )

    patch atmosphere 
    (
        (4 5 7 6)
    )
    
    wall  sides
    (
        
        (0 1 5 4)
        (2 3 7 6)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
