zhongqi2/constant/waveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format	ascii;
    class	dictionary;
    object	waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

seaLevel            1.08;

seaLevelAsReference false;

relaxationNames     ( inlet outlet );

initializationName  outlet;

inletCoeffs
{
    waveType            stokesFirst;
    Tsoft               2.2;
    depth               1.08;
    period              2.2;
    direction           ( 1 0 0 );
    phi                 0;
    height              0.15;
    waveNumber          (1.03201 0 0);
    omega               2.85599;

    relaxationZone
    {
        relaxationScheme    Spatial;
        relaxationShape     Rectangular;
        beachType           Empty;
        relaxType           INLET;
        startX              ( 0 -0.8 1.08 );
        endX                ( 3 0.8 1.08 );
        orientation         ( 1 0 0 );
    }
}

outletCoeffs
{
    waveType            potentialCurrent;
    U                   ( 0 0 0 );
    Tsoft               2;

    relaxationZone
    {
        relaxationScheme    Spatial;
        relaxationShape     Rectangular;
        beachType           Empty;
        relaxType           OUTLET;
        startX              ( 8 -0.8 1.08 );
        endX                ( 11 0.8 1.08 );
        orientation         ( 1 0 0 );
    }
}



// ************************************************************************* //
