zhongqi2/constant/waveProperties.input
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      environmentalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

seaLevel	1.08;
seaLevelAsReference   false;
// A list of the relaxation zones in the simulation. The parameters are given
// in <name>Coeffs below.
relaxationNames (inlet outlet);

initializationName outlet;

inletCoeffs
{
    waveType    stokesFirst;  
    Tsoft       2.2;
    period      2.2;
    depth       1.08;
    direction   (1.0 0 0);
    phi         0.000000;
    height      0.15;
    
    // Specifications on the relaxation zone shape and relaxation scheme
    relaxationZone
    {
        relaxationScheme Spatial;
        relaxationShape  Rectangular;
        beachType        Empty;
    
        relaxType   INLET;
        startX      (0 -0.8 1.08);
        endX        (3 0.8  1.08);
        orientation      (1.0 0.0 0.0);
    }
};
outletCoeffs
{
    waveType    potentialCurrent;
    U           (0 0 0);
    Tsoft       2;
    
    // Specifications on the relaxation zone shape and relaxation scheme
    relaxationZone
    {
        relaxationScheme Spatial;
        relaxationShape  Rectangular;
        beachType        Empty;
    
        relaxType   OUTLET;
        startX      (8 -0.8 1.08);
        endX        (11 0.8  1.08);
        orientation      (1.0 0.0 0.0);
    }
};



// ************************************************************************* //
